import random

day = {"01":"первое", "02":"второе","03":"третье","04":"четвертое","05":"пятое",
"06":"шестое", "07":"седьмое", "08":"восьмое", "09":"девятое", "10":"десятое",
"11":"одиннадцатое", "12":"двенадцатое", "13":"тренадцатое", "14":"четырнадцатое",
"15":"пятнадцатое", "16":"шестнадцатое", "17":"семнадцатое", "18":"восемнадцатое",
"19":"девятнадцатое", "20":"двадцатое", "21":"двадцать первое", "22":"двадцать второе",
"23":"двадцать третье", "24":"двадцать четвертое", "25":"двадцать пятое",
"26":"двадцать шестое", "27":"двадцать седьмое", "28":"двадцать восьмое",
"29":"двадцать девятое", "30": "тридцатое", "31":"тридцать первое"}


month = {"01":"января", "02":"февраля", "03":"марта", "04":"апреля", "05":"мая", "06":"июня",
"07":"июля", "08":"августа", "09":"сентября", "10":"октября", "11":"ноября", "12":"декабря"}

year = {"2000":"две тысячный", "2001":"две тысячи первого", "2002":"две тысячи второго", "2003":"две тысячи третьего",
"2004":"две тысячи четвертого", "2005":"две тысячи пятого", "2006":"две тысячи шестого",
"2007":"две тысячи седьмого", "2008":"две тысячи восьмого","2009":"две тысячи девятого",
"2010":"две тысячи десятого","2011":"две тысячи одиннадцатого", "2012":"две тысячи двенадцатого",
"2013":"две тысячи тренадцатого", "2014":"две тысячи четырнадцатого", "2015":"две тысячи пятнадцатого",
"2016":"две тысячи шестнадцатого", "2017":"две тысячи семьнадцатого","2018":"две тысячи восемьнадцатого",
"2019":"две тысячи девятнадцатого", "2020":"две тысячи двадцатого", "2021":"две тысячи двадцать первого"}

print(day["04"], month["05"], year["2021"])

n = int(input('введите количество случайных элементов в списке: '))
my_list = []
for el in range(n):
	my_list.append(random.randint(-100, 100))

print(my_list)

first_list = {1, 2, 3, 4, 5, 6, 2, 5, 1}
second_list = {1, 2, 2, 1, 3, 4, 5, 5,} 
print(first_list)
